# parameters
nc: 80  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple


# anchors
anchors:
- [10,13, 16,30, 33,23]  # P3/8
- [30,61, 62,45, 59,119]  # P4/16
- [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
stem:
  # [from, max-number, module, args]
    [
      [-1, 1, ElasticConv, [64, [5,7], 2, None, 1, True, 'relu']],  # 0-P1/2
    ]
stage1:
   [
    [-1, 1, ElasticConv, [128, [3,5], 2, None, 1, True, 'relu']],  # 1-P2/4
    [-1, 3, ElasticBottleneck, [128, True, [3,5], [0.3, 0.5], 1, 'relu']], # 2
   ]
stage2:
   [
    [-1, 1, ElasticConv, [256, [3,5], 2, None, 1, True, 'relu']],  # 3-P3/8
    [-1, 9, ElasticBottleneck, [256, True, [3,5], [0.3, 0.5], 1, 'relu']], # 4
   ]
stage3:
   [
     [-1, 1, ElasticConv, [512, [3,5], 2, None, 1, True, 'relu']],  # 5-P4/16
    [-1, 9, ElasticBottleneck, [512, True, [3,5], [0.3, 0.5], 1, 'relu']], # 6
   ]
stage4:
   [
     [-1, 1, ElasticConv, [1024,[3,5], 2, None, 1, True, 'relu']],  # 7-P5/32
     [-1, 1, SPP, [1024, [5, 9, 13], 'relu']], # 8
     [-1, 3, ElasticBottleneck, [1024, False, [3,5], [0.3, 0.5], 1, 'relu']],  # 9
   ]

head1:
  [
    [-1, 3, ElasticBottleneck, [1024, False, [3,5], [0.3, 0.5], 1, 'relu']]  # 10
  ]
head2:
  [
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4, 12
   [-1, 1, Conv, [512, 1, 1, None, 1, True, 'relu']], # 13
   [-1, 3, ElasticBottleneck, [512, False, [3,5], [0.3, 0.5], 1, 'relu']], # 14
  ]
head3:
  [
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 15
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3, 16
   [-1, 1, Conv, [256, 1, 1, None, 1, True, 'relu']], # 17
   [-1, 3, ElasticBottleneck, [256, False, [3,5], [0.3, 0.5], 1, 'relu']], # 18
  ]
Detect:
  [
   [[18, 14, 10], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
