# parameters
nc: 80  # number of classes
# depth_multiple: 0.33  # model depth multiple
# width_multiple: 0.50  # layer channel multiple
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple

# anchors
anchors:
# - [28,31, 53,73, 91,39 ]  # P3/8
# - [94,219, 120,86, 173,337]  # P4/16
# - [214,99, 287,176, 376,365]  # P5/32
- [10,13, 16,30, 33,23]  # P3/8
- [30,61, 62,45, 59,119]  # P4/16
- [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
   [[-1, 1, Conv, [64, 5, 2, None, 1, True, 'relu']],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2, None, 1, True, 'relu']],  # 1-P2/4
   [-1, 3, Bottleneck, [128, True, 1, 0.5, 'relu']], # 2
   [-1, 1, Conv, [256, 3, 2, None, 1, True, 'relu']],  # 3-P3/8
   [-1, 9, Bottleneck, [256, True, 1, 0.5, 'relu']], # 4
   [-1, 1, Conv, [512, 3, 2, None, 1, True, 'relu']],  # 5-P4/16
   [-1, 9, Bottleneck, [512, True, 1, 0.5, 'relu']], # 6
   [-1, 1, Conv, [1024, 3, 2, None, 1, True, 'relu']],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13], 'relu']], # 8
   [-1, 3, Bottleneck, [1024, False, 1, 0.5, 'relu']],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 3, Bottleneck, [1024, False, 1, 0.5, 'relu']],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4, 12
   [-1, 1, Conv, [512, 1, 1, None, 1, True, 'relu']], # 13
   [-1, 3, Bottleneck, [512, False, 1, 0.5, 'relu']], # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 15
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3, 16
   [-1, 1, Conv, [256, 1, 1, None, 1, True, 'relu']], # 17
   [-1, 3, Bottleneck, [256, False, 1, 0.5, 'relu']], # 18
   [[18, 14, 10], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]