# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
- [28,31, 53,73, 91,39 ]  # P3/8
- [94,219, 120,86, 173,337]  # P4/16
- [214,99, 287,176, 376,365]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
    [[-1, 1, Conv, [64, 5, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, Bottleneck, [128]], # 2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, Bottleneck, [256]], # 4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, Bottleneck, [512]], # 6
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]], # 8
   [-1, 3, Bottleneck, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 3, Bottleneck, [1024, False]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
  #  [-1, 1, nn.Upsample, ["tuple32,42", None, 'nearest']], # 11
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4, 12
   [-1, 1, Conv, [512, 1, 1]], # 13
   [-1, 3, Bottleneck, [512, False]], # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 15
    # [-1, 1, nn.Upsample, ["tuple64,84", None, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3, 16
   [-1, 1, Conv, [256, 1, 1]], # 17
   [-1, 3, Bottleneck, [256, False]], # 18
   [[18, 14, 10], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]